---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.DesignHeatingLoad
source: html/f51dbce5-ead6-58de-162c-91a84d2748da.htm
---
# Autodesk.Revit.DB.Mechanical.Space.DesignHeatingLoad Property

Get or set the Design Heating Load of the Space.

## Syntax (C#)
```csharp
public double DesignHeatingLoad { get; set; }
```

## Remarks
This property is used to get or set the Design Heating Load of the Space.